{
  "headTitle": "Princes Street Hostel - Rooms",
  "title": "Discover all the rooms that we have to offer !",
  "desc": "Our hostel is divided into 4 levels. Each of our dorm rooms are provided with a sink and mirror, lockers to store your personnal belongings, easy access to shared bathrooms and of course a comfortable single bed specially made for you. Our private double rooms sport storage furniture as oppose to lockers, large towels and of course the larger bedsize. Both rooms options included access to our sociable lounge with many tables and a sofa and beanbag to relax in. Also included is access to our new and improved kitchen with free tea and coffee for a good start to your day.",
  "metaImage": "https://firebasestorage.googleapis.com/v0/b/nuxt-web-template.appspot.com/o/klingking-beach-mid-sq.jpg?alt=media&token=fe9953a8-95d2-4c70-97c8-ae8df6816bdb",
  "body": [
    {
      "square": true,
      "numColumns": 3,
      "tilesGrid": [
        {
          "name": "Private Double rooms",
          "img": "https://dl.airtable.com/.attachments/429e5dbe94dcfbdd1d59605f53d00323/571bdbc8/private-double-rooms-princes-street-hostel.jpg",
          "desc": "Bright private rooms with double style beds. These are perfect for couples, friends or anyone who prefers privacy while still enjoying the hostel environment. All private rooms are fitted with a bedside table, a lamp and an armchair. The bathrooms remained shared.",
          "url": "https://beds24.com/booking2.php?propid=150425",
          "btnLabel": "Book now"
        },
        {
          "name": "Small dorms",
          "img": "https://dl.airtable.com/.attachments/4d7a4557de064c07ac127c1fa3912620/598a0979/mixed-dorms-princes-street-hostel.jpg",
          "desc": "Bright 4 to 6 bed rooms for individuals, small groups and families. These rooms offer more privacy thanks to their reduced size. All the beds feature a double wall socket with USB ports. We are also able to lend a personal reading light which are retrievable at reception. Top bunk beds also feature their own personal basket where you can tuck away your belongings for the night. Te bed linen are fresh and evenly ironed! Some of our smaller dorms are female only so that everyone is feel comfortable.",
          "url": "https://beds24.com/booking2.php?propid=150425",
          "btnLabel": "Book now"
        },
        {
          "name": "Larger dorms",
          "img": "https://dl.airtable.com/.attachments/eac553f74eca807eeb73d7e55b643564/edd9a9a7/PrincesStreetBackpackers83.jpg",
          "desc": "Bright and spacious 8 to 12 bed rooms for individuals and bigger groups of friends. If you fancy making friends and enjoy the essence of what a hostel is you wil love the budget friendly larger dorms! All the beds feature their personal double wall socket with USB ports, we are also able to lend a personal reading light, please enquire at reception. Top beds alos feature their own personal basket where you can tuck your phone for the night. Linen are clean, fresh and evenly ironed!",
          "url": "https://beds24.com/booking2.php?propid=150425",
          "btnLabel": "Book now"
        }
      ]
    }
  ],
  "extras": [
    {
      "name": "Google Maps Reviews",
      "googleReview": {
        "placeID": "ChIJ_SVfZmPHh0gREqcwzgqtAo4"
      }
    }
  ]
}
